In [1]:
import pandas as pd

In [9]:
import warnings
warnings.filterwarnings('ignore')

In [2]:
df1 = pd.DataFrame({
    "A":['A1','A2','A3','A4'],
    'B':['B1','B2','B3','B4'],
    'C':['C1','C2','C3','C4'],
    'D':['D1','D2','D3','D4']
})

In [3]:
df1

    A   B   C   D
0  A1  B1  C1  D1
1  A2  B2  C2  D2
2  A3  B3  C3  D3
3  A4  B4  C4  D4

In [4]:
df2 = pd.DataFrame({
    'A':['A5','A6','A7','A8'],
    'B':['B5','B6','B7','B8'],
    'E':['E5','E6','E7','E8']
})

In [5]:
df2

    A   B   E
0  A5  B5  E5
1  A6  B6  E6
2  A7  B7  E7
3  A8  B8  E8

In [10]:
# concat时默认是按照outer join的方式
df_conc = pd.concat([df1, df2])

In [11]:
df_conc

    A   B    C    D    E
0  A1  B1   C1   D1  NaN
1  A2  B2   C2   D2  NaN
2  A3  B3   C3   D3  NaN
3  A4  B4   C4   D4  NaN
0  A5  B5  NaN  NaN   E5
1  A6  B6  NaN  NaN   E6
2  A7  B7  NaN  NaN   E7
3  A8  B8  NaN  NaN   E8

In [14]:
df_conc = pd.concat([df1, df2],ignore_index='True')

In [15]:
df_conc

    A   B    C    D    E
0  A1  B1   C1   D1  NaN
1  A2  B2   C2   D2  NaN
2  A3  B3   C3   D3  NaN
3  A4  B4   C4   D4  NaN
4  A5  B5  NaN  NaN   E5
5  A6  B6  NaN  NaN   E6
6  A7  B7  NaN  NaN   E7
7  A8  B8  NaN  NaN   E8

In [16]:
df_conc = pd.concat([df1, df2], ignore_index='True', join='inner')

In [17]:
df_conc

    A   B
0  A1  B1
1  A2  B2
2  A3  B3
3  A4  B4
4  A5  B5
5  A6  B6
6  A7  B7
7  A8  B8

In [18]:
pd.concat([df1, df2], axis=1)

    A   B   C   D   A   B   E
0  A1  B1  C1  D1  A5  B5  E5
1  A2  B2  C2  D2  A6  B6  E6
2  A3  B3  C3  D3  A7  B7  E7
3  A4  B4  C4  D4  A8  B8  E8